app/Controllers/Emprestimo.php

    public function index(){
        $emprestimo = $this->EmprestimoModel->findAll();
        $livro = $this->livroModel->findAll();
        $obra = $this->obraModel->findAll();
        $aluno = $this->alunoModel->findAll();
        $usuario = $this->usuarioModel->findAll();
---
SELECT *
FROM `emprestimo`
SELECT *
FROM `livro`
SELECT *
FROM `obra`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`

    public function cadastrar()
    {
        $dados = $this->request->getPost();
        $this->EmprestimoModel->save($dados);
        $this->livroModel->update($dados['id_livro'], ['disponivel' => 0]);
---
INSERT INTO `emprestimo` (`data_inicio`, `data_prazo`, `id_livro`, `id_aluno`, `id_usuario`) VALUES ('2024-06-20', '16', '5', '7', '6')
UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('5')

    public function devolucao($id){
        $emprestimo = $this->EmprestimoModel->find($id);
        $dadosobra = $this->obraModel->findAll();
        $livro = $this->livroModel->findAll();
---
SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '25'
SELECT *
FROM `obra`
SELECT *
FROM `livro`